'''
можно сделать в начале запрос никнейма, а затем, например: Добро пожаловать, MaksPvPGame!
то есть как будет выглядеть наш код:
    nickname = input("Какой никнейм вы предпочитаете?") ; или чото типо такого
    print(f"\tДобро пожаловать, {nickname}!")
затем сделать какую-нибудь вместе с этим приветствием
например:
    Добро пожаловать, {nickname}!
>> 1 <Інвентар>
>> 2 <Магазин>
то есть 1 - это будет открытие инвентаря
а 2 - соответственно - открытие магазина
либо же можно визуализировать вот так:
    Добро пожаловать, {nickname}!
[1] <Інвентар>
[2] <Магазин>

первый вариант мне лично больше нравится
пока что так также можно добавить текстом счётчик

    Добро пожаловать, {nickname}!
  У вас на счету: 50 золотых (к примеру)
>> 1 <Інвентар>
>> 2 <Магазин>

ну и со своими 50 золотых выбирай там пойти в магаз, купить себе шмоток, потом ты идёшь себе в инвентарь, и имеешь какие то себе шмотки
дальше дописывайте свои идеи
'''
